/**
  ******************************************************************************
  * @file         bsp_xxx.h
  * @author   Phone
  * @version  V1.0
  * @date      2014/08/03
  * @brief      2.4g无线模块/nrf24l01+/master 应用bsp.h
  ******************************************************************************
  * @attention
  *
  * @endverbatim
  ******************************************************************************
  * @attention
  * 移植时注意下面五星处端口定义
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#ifndef __GSM_H
#define __GSM_H

#include "includes.h"
/**
*@attention☆
**/

void clearBuff(void);
void send_call(void);
void send_english(void);
u8 RING_COM(void);



#endif /* __SPI_NRF_H */
