
/*******************************************************************************
*	
* funtion：呼吸灯
* 
*******************************************************************************/
#include "sys.h"

#define led PBout(0)

uint64_t i,j;

int main(void)
{
	void LED_Init()	;
	LED_Init()	;	        //输入输出段豆配置这两句足够了
	delay_init(72);
	
	while(1)
	{	
		for(i=0; i<800; i++)
		{
			for(j=0; j< 20*i; j++)
			{			
					led = 0;
			}
			for(j=0; j< 16000-20*i; j++)
			{			
					led = 1;
			}

		}
		for(i=0; i<800; i++)
		{
			for(j=0; j< 16000-20*i; j++)
			{			
					led = 0;
			}
			for(j=0; j< 20*i; j++)
			{			
					led = 1;
			}

		}
	}
}
