
/**
  ******************************************************************************
  * @file     BSP.c
  * @author   Phone
  * @version  V1.0
  * @date      2014/11/06
  * @brief    外设配置函数
  ******************************************************************************
  * @attention
  * 雅典娜程序
  * CPJ智能控制
  * @endverbatim
  ******************************************************************************
  * @attention
  * 无
  ******************************************************************************
  */ 
		
#include <stm32f10x.h>

//#include "BSP.h"

#include "bsp_led.h"  
#include "bsp_usart1.h"
#include "SysTick_delay.h"
#include "bsp_irda.h" 

/**-------------------------------------------------------------------------------
  * @brief   独立看门狗配置
  * @param   无
  * @retval    无
---------------------------------------------------------------------------------*/

void ALL_Config(void)
{
	LED_GPIO_Config();

//	NVIC_Configuration();
	//delay_init(72);
	SysTick_Init();
	/* 重新配置SysTick的中断优先级为最高，要不然SysTick延时中断抢占不了IO EXTI中断
 * 因为SysTick初始化时默认配置的优先级是最低的
 * 或者当你用其他定时器做延时的时候，要配置定时器的优先级高于IO EXTI中断的优先级
 */
  NVIC_SetPriority (SysTick_IRQn, 0);
	USART1_Config();
	 /* 初始化红外接收头CP1838用到的IO */
	IrDa_Init();  
}


/*********************************************END OF FILE**********************/



























