/**
  ******************************************************************************
  * @file    APP.c
  * @author  phone
  * @version V1.0
  * @date    2014-12-14
  * @brief   LCD1602显示
  ******************************************************************************
  * @attention
  *
  * @{实验平台:
  * @{雅典娜程序整理	
	* @{ USE_STM3210B_EVAL
  ******************************************************************************
  */ 
	
/* Includes ------------------------------------------------------------------*/
#include <stm32f10x.h>
#include "BSP.h"
#include "LCD_1602.h"

unsigned char dis1[] = {"   WELCOME  TO   "};
unsigned char dis2[] = {" WWW.PRECHIN.COM "};


#if 1
/**---------------------------------------------------------------------------------
  * @brief       主函数.
  * @param    		无
  *	@arg         NULL
  * @retval     null
  ---------------------------------------------------------------------------------*/
int main(void)
{
	/*首先是调用系统时钟，在3.0版本的库中，
	在main函数中仍需调用，在3.5版本中，
	系统时钟放在了启动文件这里
	函数运行的时候是先从这个汇编函数执行的
	启动文件 151行    ：
	LDR     R0, =SystemInit			  ;设置系统时钟
	SetSysClock();	
	*/
	/*便于在线调试*/
	#ifdef DEBUG
		debug();
	#endif
	/*外设硬件初始化*/
	ALL_Config();
	
	LCD_1602_CONFIG();
	
	
	
/**----------------------------------------------------------------------
* @brief 方法3，使用寄存器控制IO
-----------------------------------------------------------------------*/
	#if 1
	while(1)
	{
			LCD1602_WRITE(1,0,dis1);
			LCD1602_WRITE(2,0,dis2);
	}
	#endif	
}
#endif




/**---------------------------------------------------------------------------------
  * @brief       CPU延时函数
  * @param    		无
  ---------------------------------------------------------------------------------*/

/**---------------------------------------------------------------------------------
  * @brief       检测传递给函数的参数是否是有效的参数
  * @param    		无
	* @example		 某个参数的取值范围只能是小于3的正整数，如果给出的参数大于3，
	* @example	   则这个assert_param()可以再运行程序调用到这个函数时报错			
  ---------------------------------------------------------------------------------*/
#ifdef DEBUG
void assert_failed(uint8_t* file, uint32_t line){
while (1);}
#endif
/*********************************************END OF FILE**********************/




