
/**
  ******************************************************************************
  * @file     BSP.c
  * @author   Phone
  * @version  V1.0
  * @date      2014/11/06
  * @brief    外设配置函数
  ******************************************************************************
  * @attention
  * 雅典娜程序
  * CPJ智能控制
  * @endverbatim
  ******************************************************************************
  * @attention
  * 无
  ******************************************************************************
  */ 
		
#include <stm32f10x.h>

//#include "BSP.h"

#include "bsp_led.h"  
#include "bsp_usart1.h"
#include "bsp_TiMbase.h" 


/**-------------------------------------------------------------------------------
  * @brief   独立看门狗配置
  * @param   无
  * @retval    无
---------------------------------------------------------------------------------*/

void ALL_Config(void)
{
	LED_GPIO_Config();
  USART1_Config();
	NVIC_Configuration();
	
		/* TIM2 定时配置 */	
  TIM2_Configuration();
	
	/* 实战定时器的中断优先级 */
	TIM2_NVIC_Configuration();
	
	
		/* TIM2 重新开时钟，开始计时 */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 , ENABLE);	
	
}


/*********************************************END OF FILE**********************/



























